backend/test/artillery/http-max-throughput.yml
# Artillery HTTP Maximum Throughput Test
# Pure read operations for maximum req/sec (3,000+ req/sec peak)
# Run: npx artillery run test/artillery/http-max-throughput.yml

config:
  target: "http://localhost:4000"
  phases:
    # Warmup
    - name: "Warmup"
      duration: 10
      arrivalRate: 20
    # Ramp to high load
    - name: "Ramp to load"
      duration: 20
      arrivalRate: 50
      rampTo: 200
    # Maximum sustained load
    - name: "Max throughput"
      duration: 40
      arrivalRate: 200
    # Spike for peak measurement
    - name: "Spike"
      duration: 10
      arrivalRate: 400
    # Recovery
    - name: "Recovery"
      duration: 10
      arrivalRate: 100

  processor: "./functions.js"

  plugins:
    expect: {}
    metrics-by-endpoint: {}

  defaults:
    headers:
      Content-Type: "application/json"

  http:
    timeout: 30
    pool: 300

  ensure:
    p99: 5000
    maxErrorRate: 15

scenarios:
  # Pure read operations - high iteration count for throughput
  - name: "Max Read Throughput"
    weight: 100
    flow:
      - function: "generateUsername"
      - function: "loginUser"
      - loop:
          - get:
              url: "/api/auctions"
              headers:
                Authorization: "Bearer {{ token }}"
              expect:
                - statusCode: 200
          - get:
              url: "/api/auctions/{{ auctionId }}"
              headers:
                Authorization: "Bearer {{ token }}"
          - get:
              url: "/api/auctions/{{ auctionId }}/leaderboard"
              headers:
                Authorization: "Bearer {{ token }}"
          - get:
              url: "/api/users/balance"
              headers:
                Authorization: "Bearer {{ token }}"
        count: 30